
# Объединение множеств
# Объединение множеств – множество, состоящее из элементов, принадлежащих хотя бы одному из объединяемых множеств.


# Пересечение множеств
# Пересечение множеств – множество, состоящее из элементов, принадлежащих одновременно каждому из пересекающихся множеств.


# Разность множеств
# Разность множеств – множество, в которое входят только элементы первого множества, не входящие во второе множество.



# ТИМУР И ЕГО КОМАНДА

# my_list = [int(input()) for _ in range(6)]
# n, m, k, x, y, z = tuple(my_list)
#
# #Количество учеников на море
# res_n = n - x
# #Количество учеников в горах
# res_k = k - y
# #Количество учеников в деревне
# res_m = m - x - y
#
# total_student = res_n + res_k + res_m + x + y + z
#
# print(total_student)
#
#
# # ТИМУР И ЕГО КОМАНДА (ОТ ПРЕПОДАВАТЕЛЯ)
# n, m, k, x, y, z = [int(input()) for _ in range(6)]
#
# print(n + m + k - x - y + z)


# КНИГИ НА ПРОЧТЕНИЕ

n, m, k, x, y, z, t, a = [int(input()) for _ in range(8)]

#только одну
res_one = (n - )

